--
-- Des: 仇恨系统，管理精灵的目标，战斗，非战斗状态。
-- Author: John
-- Date: 2016年9月18日 星期日 农历八月十八
--

require "sprite_base"

sprite_hared = Class.define("sprite_hared")

----------------------------------------------------------------------------------------------
---- 表内变量
----------------------------------------------------------------------------------------------

-- 主人
local sprite_hared.owner = nil

-- 当前目标
local sprite_hared.target = nil

-- 仇恨列表
local sprite_hared.haredList = {}

----------------------------------------------------------------------------------------------
---- 继承函数
----------------------------------------------------------------------------------------------

-- 构造
function perception_base:_ctor()

    -- 初始化内部变量

end

----------------------------------------------------------------------------------------------
---- 内部逻辑
----------------------------------------------------------------------------------------------

----------------------------------------------------------------------------------------------
---- 外部接口
----------------------------------------------------------------------------------------------

-- 初始化
function init(_owner)
    assert(_owner == nil)
    self.owner = _owner
end

-- 得到当前目标,没有则返回空
function getTarget()
    return self.target
end

-- 设置当前目标
function setTarget(_sprite)
  --如果为空，清空检查是否脱离战斗状态

  --如果不为空，则直接设置
   self.target = _sprite
end

-- 当我被人注视时，我需要知道
function lookYou(_lookSprite)
    --将目标添加到haredList中,暂时还不实现，确定Key，value后再实现。
end

----------------------------------------------------------------------------------------------
---- 通信接口
----------------------------------------------------------------------------------------------