--
-- Des: 雷达感知器
-- Author: John
-- Date: 2016年9月18日 星期日 农历八月十八
-- 文档: https://worktile.com/project/ff9e093759b04c258f531c3b39808063/page/269e05f7ba3b490caca35aea2753f612
--

require "sprite_base"

perception_radar = Class.define("perception_radar", perception_base)

----------------------------------------------------------------------------------------------
---- 表内变量
----------------------------------------------------------------------------------------------

-- 问题集
perception_radar.AskDict =
{
    ["HasTarget"] = self.hasTarget
}

----------------------------------------------------------------------------------------------
---- 继承函数
----------------------------------------------------------------------------------------------

perception_radar.distance = 0

----------------------------------------------------------------------------------------------
---- 内部逻辑
----------------------------------------------------------------------------------------------

-- 感知器的刷新帧
function perception_radar:tick()
    -- 得到目标
    local target = owner.hared.getTarget()
    -- 如果目标不为空且失效，则放弃目标
    if target ~= nil then
        -- 目标是否死亡

    end

    -- 如果没有目标,则寻找目标
    if target == nil then

    end

    -- 如果有目标，则计算距离
    if target ~= nil then

    end
end

-- 是否有目标
function perception_radar:hasTarget(...)
    return self.owner.hared.getTarget() ~= nil
end

----------------------------------------------------------------------------------------------
---- 外部接口
----------------------------------------------------------------------------------------------

-- 行为树的询问函数
function perception_radar:Ask(_askType, _args)
    return self.AskDict[_askType]( _args)
end

----------------------------------------------------------------------------------------------
---- 通信接口
----------------------------------------------------------------------------------------------